/* Написати програму, яка обчислює вирази за двома формулами.
Попередньо підготуйте тестові приклади для другої формули з допомогою калькулятора
(результати обчислення за двома формулами мають співпадати */

#include<iostream>
#include <math.h>

using namespace std;

int main()
{

    float a;
    float z1, z2;

    cout << "Введіть значення а:";
    cin >> a;


    z1 = cos(a) + cos(2 * a) + cos(6 * a) + cos(7 * a);      /* result is z = 1.83823 */
    cout << "Значення першого виразу:" << z1 << endl;

    z2 = 4 * cos(a / 2) * cos(5 * a / 2) * cos(4 * a);     /* result is z = 1.83823 */
    cout << "Значення другого виразу:" << z2 << endl;

    return 0;
}